Revit 2024 API
ComponentRepeaterSlot.FamilyType Property
 The id of the family type of the component in the slot, or invalid id if the slot is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId FamilyType { get; set; }
Visual Basic
Public Property FamilyType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ FamilyType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: Invalid type for the slot. The type must be an adaptive family with no shape handles. In addition, it must have same category and same number of placement points as the current type of the repeater.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace